In [1]:
import pandas as pd

data = {'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Edward', 'Fiona', 'George', 'Hannah', 'Isaac', 'Jack'],
        'Salary': [50000, 75000, 60000, 80000, 90000, 120000, 75000, 65000, 54000, 72000]}

df = pd.DataFrame(data)

In [2]:
df

      Name  Salary
0    Alice   50000
1      Bob   75000
2  Charlie   60000
3    David   80000
4   Edward   90000
5    Fiona  120000
6   George   75000
7   Hannah   65000
8    Isaac   54000
9     Jack   72000

In [7]:
result=df.nsmallest(3, "Salary")

In [8]:
result

      Name  Salary
0    Alice   50000
8    Isaac   54000
2  Charlie   60000

In [12]:
#          WITHOUT LIMITS-------------------------------

sorteddf = df.sort_values(by="Salary", ascending=False)

In [13]:
sorteddf

      Name  Salary
5    Fiona  120000
4   Edward   90000
3    David   80000
1      Bob   75000
6   George   75000
9     Jack   72000
7   Hannah   65000
2  Charlie   60000
8    Isaac   54000
0    Alice   50000

In [16]:
top3salaries = sorteddf["Salary"][:3].unique()

In [17]:
top3salaries

array([120000,  90000,  80000])